#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//int main()
//{
//	unsigned char a = 200;
//	unsigned char b = 100;
//	unsigned char c = 0;
//	c = a + b;
//	//c = 300
//	//0001 0010 1100(300转换成二进制)
//	//0010 1100（char类型，所以只取低八位）
//	//00000000 00000000 00000000 00101100（整形提升，转换成十进制为44）
//	//正数的原码、反码、补码都相等
//	
//	printf("%d %d", a + b, c);//300  44
//	return 0;
//}

//int main()
//{
//	//在32位大端模式处理器上变量b等于
//	//大端模式：高位存储在低内存中
//	unsigned int a = 0x1234; 
//	//在内存中存储为：0x 00 00 43 21
//	unsigned char b = *(unsigned char *)&a;
//	printf("%d", b);
//}

//int main()
//{
//	char a[1000] = { 0 };
//	int i = 0;
//	for (i = 0; i<1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//打印杨辉三角
//int main()
//{
//	int a[10][10] = {0};
//	int i, j;
//	for (i = 0; i < 10; i++)
//	{
//		a[i][0] = 1;//每一行的第一个和最后一个都为1
//		for (j = 1; j < i+1; j++)
//		{
//			a[i][j] = a[i - 1][j] + a[i - 1][j - 1];
//		}
//	}
//
//	for (i = 0; i < 10; i++) //填完打印
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%d ", a[i][j]);
//		}
//		putchar('\n');
//	}
//}

//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//
//以下为4个嫌疑犯的供词 :
//
//A说：不是我。
//
//B说：是C。
//
//C说：是D。
//
//D说：C在胡说
//
//已知3个人说了真话，1个人说的是假话。
//
//现在请根据这些信息，写一个程序来确定到底谁是凶手。

//int main()
//{
//	int murder[4] = { 0 }; //默认4个人都不是凶手
//
//	int i;
//	for (i = 0; i < 4; i++) //遍历假设四个人中的某个人是凶手
//	{
//		murder[i] = 1; //假设某个人是凶手
//		if ((murder[0] != 1) +
//			(murder[2] == 1) +
//			(murder[3] == 1) +
//			(murder[3] != 1) == 3)
//		{
//			break; //满足就代表就是你了！
//		}
//		murder[i] = 0; //不满足还他清白
//	}
//
//	putchar('A' + i); //打印凶手的编号。我们的编号是0 1 2 3，加上'A'后变成A B C D。
//	return 0;
//}
//
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//
//A选手说：B第二，我第三；
//
//B选手说：我第二，E第四；
//
//C选手说：我第一，D第二；
//
//D选手说：C最后，我第三；
//
//E选手说：我第四，A第一；
//
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。

int main()
{
	int p[5][2] = {0};//假设五个人的话都错误

	return 0;
}